#### BarTypeDiameterOptions Members

---

|  |
| --- |
| BarTypeDiameterOptions Class   Constructors   Methods   Properties   See Also |

The  BarTypeDiameterOptions  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | BarTypeDiameterOptions | Constructs a new BarTypeDiameterOptions with default settings. |
| Public method | BarTypeDiameterOptions(RebarBarType) | Constructs a new BarTypeDiameterOptions copying the diameter information from the bar type. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  BarTypeDiameterOptions |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BarModelDiameter | Represents the bar model diameter of the RebarBarType. |
| Public property | BarNominalDiameter | Represents the bar nominal diameter of the RebarBarType. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | StandardBendDiameter | Represents the standard bar bend diameter of the RebarBarType. |
| Public property | StandardHookBendDiameter | Represents the standard hook bend diameter of the RebarBarType. |
| Public property | StirrupTieBendDiameter | Represents the stirrup/tie bar and hook bend diameter of the RebarBarType. |

# See Also

BarTypeDiameterOptions Class

Autodesk.Revit.DB Namespace